cask_args appdir: '/Applications'

# Packages

tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'ruby'
brew 'node'
brew 'zsh'
brew 'git'
brew 'yarn'
brew 'mongodb'
brew 'fzf'

# Apps

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox-esr'
cask 'firefoxnightly'
cask 'brave'
cask 'opera'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'iterm2'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'spectacle'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto'
cask 'font-noto-sans'
cask 'font-noto-mono'
cask 'font-noto-serif'
