#!/usr/bin/env bash

cask_args appdir: '/Applications'

# Packages

tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'
tap 'homebrew/dupes'

brew 'ruby'
brew 'node'
brew 'zsh'
brew 'git'
brew 'yarn'
brew 'mongodb'
brew 'fzf'
brew 'tree'
brew 'php-version'
brew 'php71'
brew 'wp-cli'
brew 'composer'
brew 'mariadb'
brew 'wifi-password'

# Apps

tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox-esr'
cask 'firefoxnightly'
cask 'brave'
cask 'opera'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'iterm2'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'spectacle'
cask 'yujitach-menumeters'
cask 'macdown'
cask 'virtualbox'
cask 'gitify'
cask 'google-drive'
cask 'hyper'
cask 'sequel-pro'
cask '1password'
cask 'whatsapp'

# Fonts

tap 'caskroom/fonts'

cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto'
cask 'font-noto-sans'
cask 'font-noto-mono'
cask 'font-noto-serif'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-dz'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-lgc'
cask 'font-inconsolata-g-for-powerline'
